app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Fourth Subject', 4, FALSE, '2022-07-06 08:49:32.262597', '2022-07-06 08:49:32.262597')
---
  def create
    @subject = Subject.new(subject_params)

    if (@subject.save)

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
---
  def edit
    @subject = Subject.find(params[:id])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
UPDATE `subjects` SET `subjects`.`name` = 'First Subject 1', `subjects`.`updated_at` = '2022-07-06 09:18:03.536233' WHERE `subjects`.`id` = 1
---
  def update
    @subject = Subject.find(params[:id])

    if (@subject.update(subject_params))

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 7 LIMIT 1
---
  def delete
    @subject = Subject.find(params[:id])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 7 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 7
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy